Revit 2026 API

# CeramicApplicationType Enumeration

---

The enumerated type representing the permitted values for the asset property "CeramicApplication" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CeramicApplicationType
```
```vb
Public Enumeration CeramicApplicationType
```
```cpp
public enum class CeramicApplicationType
```
```fsharp
type CeramicApplicationType
```

| Member name | Value | Description |
| --- | --- | --- |
| HighGlossy | 0 |  |
| Matte | 2 |  |
| Satin | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace